app/Controllers/setup_persediaan/Stock.php

    public function new()
    {
        // $builder = $this->db->table('stock1');
        // $query = $builder->get();
        // $data['dtstock'] = $query->getResult();
        $data['dtsatuan'] = $this->objSatuan->findAll();
        $data['dtlokasi'] = $this->objLokasi->findAll();
        $data['dtstock'] = $this->objStock->getStockWithRelations();
        $data['dtgroup'] = $this->db->table('group1')->get()->getResult();
        $data['dtkelompok'] = $this->db->table('kelompok1')->get()->getResult();
        $data['dtsupplier'] = $this->db->table('setupsupplier1')->get()->getResult();
---
SELECT *
FROM `group1`
SELECT *
FROM `kelompok1`
SELECT *
FROM `setupsupplier1`