app/Controllers/setup/SetupSalesman.php

SELECT *
FROM `setupsalesman1`
---
    public function new()
    {
        $builder = $this->db->table('setupsalesman1');
        $query = $builder->get();