app/Models/setup_persediaan/ModelGroup.php

    public function getGroupWithSetupBuku()
    {
        return $this->select('group1.*, setupbuku1.nama_setupbuku')
            ->join('setupbuku1', 'setupbuku1.id_setupbuku = group1.id_setupbuku', 'left')
            ->findAll();
---
SELECT `group1`.*, `setupbuku1`.`nama_setupbuku`
FROM `group1`
LEFT JOIN `setupbuku1` ON `setupbuku1`.`id_setupbuku` = `group1`.`id_setupbuku`