app/Models/setup_persediaan/ModelStock.php

SELECT `stock1`.*, `lokasi1`.`nama_lokasi`, `group1`.`nama_group`, `kelompok1`.`nama_kelompok`, `satuan1`.`kode_satuan`, `setupsupplier1`.`nama` as `nama_setupsupplier`
FROM `stock1`
LEFT JOIN `lokasi1` ON `lokasi1`.`id_lokasi` = `stock1`.`id_lokasi`
LEFT JOIN `group1` ON `group1`.`id_group` = `stock1`.`id_group`
LEFT JOIN `kelompok1` ON `kelompok1`.`id_kelompok` = `stock1`.`id_kelompok`
LEFT JOIN `setupsupplier1` ON `setupsupplier1`.`id_setupsupplier` = `stock1`.`id_setupsupplier`
LEFT JOIN `satuan1` ON `satuan1`.`id_satuan` = `stock1`.`id_satuan`
---
    public function getStockWithRelations()
    {
        return $this->select('stock1.*,
                          lokasi1.nama_lokasi,
                          group1.nama_group,
                          kelompok1.nama_kelompok,
                          satuan1.kode_satuan,
                          setupsupplier1.nama as nama_setupsupplier')
            ->join('lokasi1', 'lokasi1.id_lokasi = stock1.id_lokasi', 'left')
            ->join('group1', 'group1.id_group = stock1.id_group', 'left')
            ->join('kelompok1', 'kelompok1.id_kelompok = stock1.id_kelompok', 'left')
            ->join('setupsupplier1', 'setupsupplier1.id_setupsupplier = stock1.id_setupsupplier', 'left')
            ->join('satuan1', 'satuan1.id_satuan = stock1.id_satuan', 'left')
            ->findAll();