app/Controllers/Setuppiutang.php

SELECT *
FROM `setuppiutang1`
---
    public function new()
    {
        $builder = $this->db->table('setuppiutang1');
        $query = $builder->get();